<?php

$students = array("Ivan", "Maria", "Pesho", "Dimitar");
print_r($students);



/* 
Когато използваме командата echo за извеждане на масив, ще получим грешка,
защото echo не е предназначен за извеждане на масиви. Ако искаме да използваме echo,
можем да използваме функции като implode или join, за да преобразуваме масива в символен низ
*/
=====================================================================================================
?>


<?php

$students = array("Ivan", "Maria", "Pesho", "Dimitar");
echo implode(", ", $students);

?>