<?php

function firstEx()
    try{
        function(secondEx)
    }


function secondEx()


Напишете скрипт, който да съдържа две функции
първата да извиква втората
втората да хвърле ексепшън  и къстом ексепшън в зависимост от подаденият параметър $num
При четен $num се изхвърля custom exepction иначе exepctionкойто да съдържа две функцииfirstEx()
Прихванете двата ексепшъна в първата функция и покажете подходящо съобщение
функцията 1 трябва да тества всички слуачайНапишете скрипт, който да съдържа две функцииНапишете скрипт, който да съдържа две функции